// Задача 6
Console.WriteLine("введите число");
int number6 = Convert.ToInt32(Console.ReadLine());
if (number6%2 == 0)
{
    Console.WriteLine("число четное");
}
else{
    Console.WriteLine("число не четное");
}